//
// HelloWorldStrings.uni
//
// String resources for HelloWorld application
//
/=#
#langdef	eng "English"
#langdef	fra "Français"

#string STR_HELLOWORLD	#language eng "Hello, world!\n"
			#language fra "Hello, world!\n"
#string STR_GOODBYE	#language eng "Goodbye, Framework Class!\n"
			#language fra "Goodbye, Framework Class!\n"
#string STR_HELLOWORLD_LINEHELP #language eng  "Hello world help line"


#string STR_SHELLENV_GNC_COMMAND_NOT_SUPPORT  
#language eng  "%hs: This command is not supported in the \n"
               "underlaying EFI version, required EFI version \n"
               "should be %hd.%hd or above\n\n"
#language fra  "%hs: This command is not supported in the \n"
               "underlaying EFI version, required EFI version \n"
               "should be %hd.%hd or above\n\n"
